untitled folder/app/controllers/cocktails_controller.rb

SELECT "cocktails".* FROM "cocktails"
---
  def index
    @cocktails = Cocktail.all

INSERT INTO "cocktails" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "ewce"], ["created_at", "2017-07-06 18:50:02.536493"], ["updated_at", "2017-07-06 18:50:02.536493"]]
---
  def create
    @cocktail = Cocktail.new(cocktail_params)
    if @cocktail.save

SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @cocktail = Cocktail.find(params[:id])

DELETE FROM "cocktails" WHERE "cocktails"."id" = $1  [["id", 1]]
---
  def destroy
    @cocktail.destroy