app/controllers/doses_controller.rb

  def destroy
    @dose = Dose.find(params[:id])
    @cocktail = @dose.cocktail
    @dose.destroy
---
SELECT  "doses".* FROM "doses" WHERE "doses"."id" = $1 LIMIT $2  [["id", 150], ["LIMIT", 1]]
DELETE FROM "doses" WHERE "doses"."id" = $1  [["id", 150]]