app/controllers/doses_controller.rb

  def new
    @dose = Dose.new()
    @cocktail = Cocktail.find(params[:cocktail_id])
    @ingredients = Ingredient.all
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "ingredients".* FROM "ingredients"

  def create
    @cocktail = Cocktail.find(params[:cocktail_id])
    @dose = Dose.new()
    @dose.description = dose_params['description']
    @dose.ingredient = Ingredient.find(dose_params[:ingredient_id])
    @dose.cocktail = Cocktail.find(params[:cocktail_id])
    if @dose.save!
---
SELECT  "cocktails".* FROM "cocktails" WHERE "cocktails"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "ingredients".* FROM "ingredients" WHERE "ingredients"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "doses" ("description", "created_at", "updated_at", "cocktail_id", "ingredient_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["description", "5 oz"], ["created_at", "2017-07-07 15:25:03.164482"], ["updated_at", "2017-07-07 15:25:03.164482"], ["cocktail_id", 3], ["ingredient_id", 3]]